A property set name cannot be an empty string.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId EmptyPropertySetName { get; }
  Visual Basic
Public Shared ReadOnly Property EmptyPropertySetName As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ EmptyPropertySetName {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PropertySetElementFailures Class
  Autodesk.Revit.DB Namespace